[LANG]
language=English (United States)
[FONT]
font-name=Arial
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=SQL syntax error
200002=File not found
200003=Bad file.
200004=Invalid params.
200026=The table name is duplicated.
200027=The table name is not exists.
200028=Failed to import CSV file,Check whether the contents of the CSV file and configuration items are correct.
300001=No column has been selected.
300002=SQL statement can't be empty.
300003=Only SELECT statements are supported.
[STRING]
home=Home
database=Database
analysis=Analysis
view=View
setting=Settings
items=Items
tables=Tables
views=Views
store-processes=Store Procs
functions=Functions
triggers=Triggers
events=Events
columns=Columns
indexes=Indexes
table=Table
clear-all=Clear All
loading=Loading...
yes=OK
no=Cancel
welcome-text=Welcome to CuteMySQL
home-text1=CuteMySQL is the graphical user interface(GUI) tool for MySQL.
home-text2=It allows you to design,create and browse you database,work in database objects
home-text3=and insert data as well as design and run SQL queries to work with stored data.
home-text4=You can also migrate database and data from other database vendors to your MySQL database.
connect-section-text=MySQL Connections
connect-name=Connection Name
analysis-text1=CuteMySQL allows you to analyze and optimize the performance of SQL statements.
analysis-text2=And it allows you to analyze the storage capacity of each table in the database 
analysis-text3=and configure the parameters of the database to optimize the database.
perf-analysis-section-text=Performance Analysis 
error-text=System error:
create-connection=Create a new server connection. (Ctrl+N)
manage-connections=Manage server connections. (Ctrl+M)
host=MySQL Host Address
username=Username
password=Password
save-password=Save Password
port=Port
databases=Database(s)
databases-desription=(Use ';' to separate multiple databases. Leave blank to display all.)
use-compressed=Use Compressed Protocol
read-only-connection=Read-Only Connection
session-idel-timeout=Session Idle Timeout
keep-alive-interval=Keep Alive Interval
default=Default
seconds=seconds
connect=Connect
cancel=Cancel
test-connect=Test Connect
use-ssh-tunnel=Use SSH Tunneling
ssh-host=SSH Host Address
ssh-port=SSH Port
passphrase=Passphrase
save-password=Save Passphrase
public-key=Public Key
private-key=Private Key
choose-password-publickey=Choose Password Or Public Key
save-passphrase=Save Passphrase
use-ssl-encryption=Use SSL Encryption
ca-certificate=CA Certificate
cipher=Cipher
ssl-authentication=SSL Authentication
use-authentication=Use Authentication
client-key=Client key
client-certificate=Client Certificate
new-connect-name=New Connection
connect-success=The connection is successful.
connect-fail=The connection failed
notice=Notice
error-notice=Error Notice
remove-connection-confirm=Do you really want to delete the connection?
confirm=Confirm
open-file=Open File
create-database=Craate a new database for the selected connection. (Ctrl+D)
refresh=Refresh ALL. (F5)
duplicate-selected-item=Duplicate the select item. (Ctrl+D)
delete-selected-item=Delete the selected item.(Del)
select-connection=Connection
database-name=Database Name
database-charset=Database Charset
database-collation=Database Collation
create=Create
create-database-caption=Create Database
alter-database-caption=Alter Database
not-choose-connection=Please choose the Connection.
no-database-name=Please input the Database Name.
override-user-db=The data of the file can't be retrieved, Do you overwrite the database?
create-db-success-text=The database is created successfully.
open-db-exists-inlist=The database is opened, do not repeat the operation.
open-db-success-text=The database is opened successfully.
delete-user-db=Do you remove the database "{dbName}" from the inventory?
delete-db-success-text=The database is removed successfully.
query-editor=Query
history=History
history-tip=History (F8)
result-list=Result
result-info=Messages
result-table-data=Table Data
table-properties=Properties
exec-select-sql=Execute the current query (F9)
exec-all-sql=Execute all queries (F10)
explain-select-sql=Explain the selected sql statement (F11)
explain-query-plan-sql=Explain query plan for the selected sql statement (F12)
query-page-help=Autocomplete: [Tab]->Next tag; [Ctrl+Space]—>List matching tags; [Ctrl+Enter]->Lists all tags
no-select-userdb=No database is selected.
no-sql-statement=No SQL statement is available.
no-sql-content=No sql statement in the query editor.
show-form-view=Form View
export-result-as=Export As... (Ctrl+Alt+E)
copy-result-data=Copy data to clipboard
clear-all=Clear All
ok=OK
cancel=Cancel
export-text-description=Select the format in which to export the data.
csv-settings=CSV settings
csv-field-settings=Fields
csv-line-settings=Lines
csv-charset-settings=Charset
excel-settings=Excel settings
sql-settings=SQL settings
export-fields-settings=Select the fields to export
terminated-by=Seperator
enclosed-by=Enclosed by
escaped-by=Escaped by
field-terminated-by=Field seperator
field-enclosed-by=Field enclosed by
field-escaped-by=Field escaped by
line-terminated-by=Line seperator
add-column-name=Add column names on top
csv-charset=Charset
excel-column-max-size=Text column size limit
excel-decinmal-places=Decinmal places
structure-only=Structure only
data-only=Data only
structure-and-data=Structure and data
select-all=Select All
deselect-all=Deselect All
save-to-file=Save to file
expert-fmt-error=Please select the export format.
terminated-by-error=Please input the value of "Terminated by".
enclosed-by-error=Please input the value of "Enclosed by".
escaped-by-error=Please input the value of "Escaped by".
line-terminated-by-error=Please input the righ value of "Terminated by".
excel-column-max-size-error=Please input the value of "Text column size limit".
excel-decinmal-places-error=Please input the value of "Decinmal places".
export-sql-error=Please select the SQL settings.
selected-fields-error=Please select the export column(s). 
export-path-error=Please input the export file path. 
sql-notsupport-multitable-query-error=Result export for multi-table queries and subqueries is not supported.
export-success-text=Export successful, {rows} row(s) data has been exported, open the file?
open-the-file=Open the file
export-file-exists-prompt={export-path} already exists, do you want to replace?
limit-rows=Limit rows
offset=Offset
rows=Rows
copy-all-rows-to-clipboard=Copy all rows to clipboard	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Copy selected rows to clipboard	Ctrl+Alt+H
copy-all-rows-as-sql=Copy all rows as SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=Copy selected rows as SQL	Ctrl+Alt+K
read-only=Read Only
filter=Filter (Ctrl+Alt+F)
filter-in-use=Filter in use
refresh=Refresh (Ctrl+F5)
refresh-page=Refresh
new-row-tip=Create a new row (Ctrl+Alt+N)
copy-row-tip=Copy to a new row (Ctrl+Alt+C)
save-tip=Save (Ctrl+Alt+S)
delete-tip=Delete the selected row(s) (Ctrl+Del)
cancel-tip=Cancel (Ctrl+Alt+Z)
revert-tip=Revert
save=Save
revert=Revert
column=Column
condition=Condition
value=Value
delete-confirm-text=Do you really want to delete the selected row(s)? 
query=Query
result=Result
affected-rows=Affected rows
exec-time=Execute Time
transfer-time=Transfer Time
total-time=Total Time
database-create=Create Database		Ctrl+N
database-open=Open Database		Ctrl+O
database-refresh=Refresh Database		F5
database-delete=Delete Database		Del
database-copy=Copy Database as ...		Ctrl+P
database-export-as-sql=Export Database As SQL	Ctrl+E
database-import-from-sql=Import Database From SQL	Ctrl+I
database-new=Create
database-new-table=Table
database-new-view=View
database-new-trigger=Trigger
export-as-sql-text-description=Export the table(s),view(s),trigger(s) of the selected database in SQL.
select-database=Select database
database-objects=Object(s)
structure-and-data-settings=Structure and data settings
insert-statement-settings="Insert" statement settings
tbl-statement-settings=Table statement settings
retain-column-text=Keep column names in INSERT INTO
contain-multi-rows-text=Multiple rows (VALUES) per INSERT statement
retain-table-text=Keep the old table (CREATE TABLE IF NOT EXISTS ...)
override-table-text=Overwrite the old table (DROP TABLE, then CREATE TABLE)
import-from-sql-text-description=Execue query(s) stored in a SQL batch file.
abort-on-error-text=Abort on error.
import-file-not-exists=The imported SQL file does not exist, please select it again.
import-path-empty-error=The imported file path can't be empty.
import=Import
export=Export
tbl-name=Table Name
new-table=New Table
new-view=New View
new-trigger=New Trigger
database=Database
schema=Schema
table-columns=Columns
table-indexes=Indexes
table-foreignkeys=Foreign Keys
column-name=Column Name
data-type=Data Type
default=Default
check=Check
index-name=Index Name
index-type=Index Type
index-unique=Unique
partial-clause=Partial Clause
comments=Comments
to-be-selected=To be selected
selected=Selected
up=▲
down=▼
no-columns-selected=No column has be selected.
sql-preview=SQL Preview
tbl-name-empty=The table name can't be empty.
tbl-name-duplicated=The table name is duplicated.
create-table-success-text=The table is created successfully.
alter-table-success-text=The table is altered successfully.
rename-table-success-text=The table is renamed successfully.
delete-column-confirm-text=The selected column is referenced by one or more indexes. Dropping this column will also modify the corresponding indexes.\r\n\r\nDo you want to continue?
delete-index-confirm-text=The selected column is referenced by one or more columns. Dropping this index will also modify the corresponding columns.\r\n\r\nDo you want to continue?
delete-confirm-text=Do you want to continue?
new-view=New View
new-trigger=New Trigger
create-a-view-name=Input a new view name
view-name-not-empty=The view name can't be empty.
view-name-duplicated=The view name is duplicated.
create-a-trigger-name=Input a new trigger name
trigger-name-not-empty=The trigger name can't be empty.
trigger-name-duplicated=The trigger name is duplicated.
execute-sql-success=SQL has been executed successfully.
copy-db-success-text=Database has been executed successfully.
table-open=Open Table		Alt+O
table-create=Create Table		Alt+N
table-alter=Alter Table		Alt+A
table-rename=Rename Table		Alt+M
table-truncate=Truncate Table		Alt+T
table-drop=Drop Table		Alt+Del
table-copy-as=Copy Table as ...		Alt+P
table-sharding-as=Sharding		Alt+G
table-export=Export as...		Alt+E
table-import-sql=Import From SQL File	Alt+I
table-import-csv=Import From CSV File	Alt+J
table-manage-index=Manage Indexes
table-manage-foreign-key=Manage Foreign Key
properties=Properties
primary-key-duplicated=The primary key has been defined.
foreignkey-name=Constaint Name
referencing-columns=Referencing Columns
referenced-table=Referenced Table
referenced-columns=Referenced Columns
on-update=On Update
on-delete=On Delete
insert-new-column=New column
insert-new-index=New constraint
insert-new-foreignkey=New foreign key
insert-del-column=Delete selected column(s)
insert-del-index=Delete selected index(s)
insert-del-foreignkey=Delete selected foreign key(s)
select-referenced-table-first=Select referenced table first.
new-table-name=New table name
table-name-not-empty=The table name can't be empty.
table-name-duplicated=The table name is duplicated.
ai-column-exists=The AUTOINCREMENT column already exists.
ai-fobidden-multi-pk=There are AUTOINCREMENT column, and multiple Primary key columns are not allowed.
ai-column-must-integer=The AUTOINCREMENT column must be of type INTEGER.
truncate-table-confirm-text=After the table is truncated, the data cannot be recovered.\r\n\r\nDo you want to continue?
truncate-table-success-text=The table has been truncated successfully.
drop-table-confirm-text=After the table is dropped, the data cannot be recovered.\r\n\r\nDo you want to continue?
drop-table-success-text=The table has been dropped successfully.
copy-table-text-description=Configure Copy Settings.Support table sharding.
from-db-name=Source database
from-tbl-name=Source table
to-db-name=Target database
to-tbl-name=Target table(s)
table-sharding-setttings=Table Sharding
enable-table-sharding=Enable table sharding
table-suffix-begin=Suffix {{suffix}} begin
table-suffix-end=Suffix {{suffix}} end
sharding-table-advanced-settings=Advanced settings for sharding table
enable-copy-data-with-strategy=Copy data to sharding tables with strategy
sharding-strategy-express-text=Table sharding strategy:  {n}
preview-sql=Preview SQL
structure-and-data-settings-unknown=Struct and data settings unknown.
table-suffix-error=The integer of the shard is invalid, please enter the correct value.
target-table-name-no-n=Target table name must include "{n}".
sharding-strategy-express-empty=The express of table sharding strategy can't empty.
copy-table-success-text=The table has been copied successfully.
start=Start
complete=Complete
express-title=Express for sharding strategy
functions=Select functions
express-editor-help=Express - Double click a function or column to insert into the editor
import-from-csv-text-description=Configure import from CSV settings.
source-csv-file=Source CSV file path
target-database=Target Database
target-table=Target Table
columns-settings=Columns settings
csv-data=CSV data
column-name-on-top=Column name on the top line
line-terminated-by=Line Terminated by
csv-null-as-keyword=null or NULL as SQL keyword
encoding=Encoding
import-success-text=Imported successfully.
incorrect-sql-statement=Incorrect SQL statement
import-error-text=Import error
table-manage-columns=Manage Columns
table-drop-column=Drop Column
table-manage-indexes=Manage Indexes
table-drop-index=Drop Index
create-view=Create View
open-view=Open View
drop-view=Drop View
create-trigger=Create Trigger
open-trigger=Open Trigger
drop-trigger=Drop Trigger
drop-view-confirm-text=After the view is dropped, the view cannot be recovered.\r\n\r\nDo you want to continue?
drop-view-success-text=The view has been dropped successfully.
drop-trigger-confirm-text=After the trigger is dropped, the trigger cannot be recovered.\r\n\r\nDo you want to continue?
drop-trigger-success-text=The trigger has been dropped successfully.
sql-templates=SQL statement templates
pragma-templates=Pragmas
sql-log=SQL Log
clear-all=Clear All
use=Use
explain=Explain
top=Top
untop=Untop
copy=Copy
delete=Delete
today=Today
yestoday=Yestoday
delete-sql-log-confirm-text=Do you really want to delete the sql log? 
copy-to-clipboard=Already copied to the clipboard.
save-success-text=Save successfully.
delete-success-text=Delete successfully.
data-has-changed=The data has changed, Are you sure to close the page?
not-save-and-close=Don't save,Close
cancel-close=Cancel
table-export-as=Export Table As ...	Alt+E
export-as-sql-success-text=Export successful, open the file?
new-query=New Query Window (F7)
save-current=Save Current (Ctrl+S)
save-all=Save All (Ctrl+Shift+S)
first-page=First Page
prev-page=Prev Page
next-page=Next Page
last-page=Last Page
save-if-data-has-changed=The data has changed, Do you want to save the changes first?
unsort=Unsort
tab-close-this=Close
tab-close-others=Close All But This
tab-close-left=Close All To Left
tab-close-right=Close All To Right
perf-analysis=Performance Analysis
perf-analysis-reports=Analysis Reports
store-analysis=Store Analysis
db-params=Database Params
not-select-sql=Only SELECT statements are supported
open-sql-log=Open SQL log to analyze performance (Ctrl+L)
add-sql-analysis=Enter a SQL statement to analysis performance (Ctrl+I)
sql-log-not-found=The item of SQL log is not found.
original-sql=Original SQL statement
where-clause-analysis=WHERE Clause Analysis
order-clause-analysis=ORDER Clause Analysis
covering-index-analysis=Covering Indexes Analysis
table-join-analysis=Joins Analysis
in-table=In the table
where-use-column=WHERE clause using column(s)
order-use-column=ORDER clause using column(s)
covering-index-column=WHERE and ORDER clauses using column(s)
where-use-index=WHERE clause using index(s)
order-use-index=ORDER clause using index(s)
use-covering-index=Using Covering index
create-index-for-performance=Advice: Create indexes with the following column(s) to improve query performance:
hint-index-for-performance=Tips: The index {hintIndexName} already covers the column(s): {hintIndexColumns}.
create-covering-index-for-performance=Advice: Create Covering indexes with the following column(s) to improve query performance:
create-index-togeger=Create index
create-index-individ=Create indexes individually
create-covering-index=Create Covering index
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=The following pseudocode demonstrates the execution of the query optimizer
cycle-count=Cycle statistics
optimize-cycle-count=Tips: Change the order of the JOIN table to optimize the number of cycles.
general-settings=General Settings
about=About
language-setting=Language Setting
change-language-restart-text=After you change the language, you must restart this App to take effect。
close-and-restart=Close And Restart
do-not-restart=Don't Restart
about-us=About Us
about-us-description=CuteMySQL is an open-source software developed by the author Xuehan Qin. 
version-info=Version
version-info-description=CuteMySQL v0.2.1 beta (64 bit)
feedback=Feedback
feedback-description=If you have software issues, or have ideas and suggestions for this application, please fill out the form below to feedback us.
content-text=Content
license=Apache License Version 2.0
select-columns-analysis=Select Columns Analysis
select-use-column=Select clause using the following column(s)
select-use-column-count=Column(s) count
select-use-column-advice=Advice: The SELECT statement selects more than {maxColumns} columns,Minimizing columns can improve query performance.
select-use-column-tips=Tips: Minimizing columns can improve query performance.
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=Store Analysis:
analysis-sql=SQL Analysis
open-perf-report=Open Report		Alt+O
drop-perf-report=Drop Report		Alt+Del
drop-perf-report-confirm-text=Are you sure to drop the report?
store-analysis-text=CuteMySQL allows you to analyze the storage capacity in the database.
table-store-analysis=Table {tblName} and all its indices
index-store-analysis=Index {idxName} of table {tblName}
db-disk-used-title=Disk-Space Utilization Report For {dbPath}
page-size-text=Page size in bytes
page-size-tips=Page size in bytes
file-bytes-text=Size of the file in bytes
file-bytes-tips=Size of the file in bytes
file-pgcnt-text=Pages in the whole file (measured)
file-pgcnt-tips=Pages in the whole file (measured)
file-pgcnt2-text=Pages in the whole file (calculated)
file-pgcnt2-tips=Pages in the whole file (calculated)
inuse-pgcnt-text=Pages that store data (in use)
inuse-pgcnt-tips=Pages that store data (in use)
free-pgcnt2-text=Pages on the freelist (per header)
free-pgcnt2-tips=Pages on the freelist (per header)
free-pgcnt-text=Pages on the freelist (calculated)
free-pgcnt-tips=Pages on the freelist (calculated)
av-pgcnt-text=Pages of auto-vacuum overhead
av-pgcnt-tips=Pages of auto-vacuum overhead
ntable-text=Number of tables in the database
ntable-tips=Number of tables in the database
nindex-text=Number of indices
nindex-tips=Number of indices
nmanindex-text=Number of defined indices
nmanindex-tips=Number of defined indices
nautoindex-text=Number of implied indices
nautoindex-tips=Number of implied indices
user-payload-text=Bytes of user payload stored
user-payload-tips=Bytes of user payload stored
all-tbl-entrycnt-title=Entry counts for all tables
all-tbl-pagecnt-title=Page counts for all tables
all-tbl-idx-pagecnt-title=Page counts for all tables with their indices
sperate-tbl-idx-pagecnt-title=Page counts for all tables and indices separately
all-tbl-idx-report-title=All tables and indices
total-pages-percent-text=Percentage of total database
total-pages-percent-tips=Percentage of total database
nentry-text=Number of entries
nentry-tips=Number of entries
storage-text=Bytes of storage consumed
storage-tips=Bytes of storage consumed
compressed-size-text=Bytes used after compression
compressed-size-tips=Bytes used after compression
payload-text=Bytes of payload
payload-tips=Bytes of payload
total-meta-text=Bytes of metadata
total-meta-tips=Bytes of metadata
depth-text=B-tree depth
depth-tips=B-tree depth
avg-payload-text=Average payload per entry
avg-payload-tips=Average payload per entry
avg-unused-text=Average unused bytes per entry
avg-unused-tips=Average unused bytes per entry
avg-meta-text=Average metadata per entry
avg-meta-tips=Average metadata per entry
avg-fanout-text=Average fanout
avg-fanout-tips=Average fanout
gap-cnt-text=Non-sequential pages
gap-cnt-tips=Non-sequential pages
mx-payload-text=Maximum payload per entry
mx-payload-tips=Maximum payload per entry
ovfl-cnt-text=Entries that use overflow
ovfl-cnt-tips=Entries that use overflow
int-pages-text=Index pages used
int-pages-tips=Index pages used
leaf-pages-text=Primary pages used
leaf-pages-tips=Primary pages used
ovfl-pages-text=Overflow pages used
ovfl-pages-tips=Overflow pages used
total-pages-text=Total pages used
total-pages-tips=Total pages used
int-unused-text=Unused bytes on index pages
int-unused-tips=Unused bytes on index pages
leaf-unused-text=Unused bytes on primary pages
leaf-unused-tips=Unused bytes on primary pages
ovfl-unused-text=Unused bytes on overflow pages
ovfl-unused-tips=Unused bytes on overflow pages
total-unused-text=Unused bytes on all pages
total-unused-tips=Unused bytes on all pages
all-table-report-title=All tables
all-indices-report-title=All indices
tbl-and-all-idx-report-title=Table {tblName} and all its indices
tbl-only-report-title=Table {tblName} w/o any indices
idx-only-report-title=Indices of table {tblName}
idx-report-title=Index {idxName} of table {tblName}
props-tbl-only-report-title=Table {tblName} Store Analysis
db-pragma-params=PRAGMA Parameters
db-pragma-params-text=Allows you to configure database parameters with PRAGMA statements.
db-quick-config-params=Quick Configuration
select-pragma=PRAGMA
pragma-analysis-limit-tips=Query or change a limit on the approximate ANALYZE setting. This is the approximate number of rows examined in each index by the ANALYZE command. 
pragma-application-id-tips=Used to query or set the 32-bit signed big-endian "Application ID" integer located at offset 68 into the database header.
pragma-auto-vacuum-tips=Query or set the auto-vacuum status in the database.
pragma-automatic-index-tips=Query, set, or clear the automatic indexing capability.
pragma-busy-timeout-tips=Query or change the setting of the busy timeout. 
pragma-cache-size-tips=Query or change the suggested maximum number of database disk pages that SQLite will hold in memory at once per open database file.
pragma-cache-spill-tips=Enables or disables the ability of the pager to spill dirty cache pages to the database file in the middle of a transaction. 
pragma-case-sensitive-like-tips=The default behavior of the LIKE operator is to ignore case for ASCII characters. Hence, by default 'a' LIKE 'A' is true. 
pragma-cell-size-check-tips=Enables or disables additional sanity checking on database b-tree pages as they are initially read from disk. 
pragma-checkpoint-fullfsync-tips=Query or change the fullfsync flag for checkpoint operations. If this flag is set, then the F_FULLFSYNC syncing method is used during checkpoint operations on systems that support F_FULLFSYNC. 
pragma-collation-list-tips=Return a list of the collating sequences defined for the current database connection.
pragma-compile-options-tips=returns the names of compile-time options used when building SQLite, one option per row. 
pragma-count-changes-tips=Query or change the count-changes flag. Normally, when the count-changes flag is not set, INSERT, UPDATE and DELETE statements return no data. 
pragma-data-store-directory-tips=Query or change the value of the sqlite3_data_directory global variable, which windows operating-system interface backends use to determine where to store database files specified using a relative pathname.
pragma-data-version-tips=Provides an indication that the database file has been modified. 
pragma-default-cache-size-tips=Query or set the suggested maximum number of pages of disk cache that will be allocated per open database file. 
pragma-defer-foreign-keys-tips=Enforcement of all foreign key constraints is delayed until the outermost transaction is committed. 
pragma-empty-result-callbacks-tips=Query or change the empty-result-callbacks flag.
pragma-encoding-tips=The text encoding used by the main database, one of 'UTF-8', 'UTF-16le' (little-endian UTF-16 encoding) or 'UTF-16be' (big-endian UTF-16 encoding). 
pragma-foreign-key-check-tips=Checks the database, or the table called "table-name", for foreign key constraints that are violated. 
pragma-foreign-keys-tips=Query, set, or clear the enforcement of foreign key constraints.
pragma-freelist-count-tips=Return the number of unused pages in the database file.
pragma-full-column-names-tips=Query or change the full_column_names flag. 
pragma-fullfsync-tips=Query or change the fullfsync flag. This flag determines whether or not the F_FULLFSYNC syncing method is used on systems that support it. The default value of the fullfsync flag is off. Only Mac OS X supports F_FULLFSYNC.
pragma-hard-heap-limit-tips=Impose limits on the amount of heap memory that will be by all database connections within a single process.
pragma-ignore-check-constraints-tips=Enables or disables the enforcement of CHECK constraints. The default setting is off, meaning that CHECK constraints are enforced by default.
pragma-incremental-vacuum-tips=Causes up to N pages to be removed from the freelist.
pragma-integrity-check-tips=This pragma does a low-level formatting and consistency check of the database.
pragma-journal-mode-tips=Query or set the journal mode for databases associated with the current database connection.
pragma-journal-size-limit-tips=Limit the size of rollback-journal and WAL files left in the file-system after transactions or checkpoints. 
pragma-legacy-alter-table-tips=Set or query the value of the legacy_alter_table flag. When this flag is on the ALTER TABLE RENAME command only rewrites the initial occurrence of the table name in its CREATE TABLE statement and in any associated CREATE INDEX and CREATE TRIGGER statements.
pragma-locking-mode-tips=Set or query the database connection locking-mode.
pragma-max-page-count-tips=Query or set the maximum number of pages in the database file.
pragma-mmap-size-tips=Query or change the maximum number of bytes that are set aside for memory-mapped I/O on a single database.
pragma-module-list-tips=Returns a list of virtual table modules registered with the database connection.
pragma-optimize-tips=Attempt to optimize the database.
pragma-page-count-tips=Return the total number of pages in the database file.
pragma-page-size-tips=Query or set the page size of the database. The page size must be a power of two between 512 and 65536 inclusive.
pragma-parser-trace-tips=Turn on tracing for the SQL parser used internally by SQLite. 
pragma-query-only-tips=Prevents data changes on database files when enabled. 
pragma-quick-check-tips=This pragma does a low-level formatting and consistency check of the database skipping UNIQUE and index consistency checks.
pragma-read-uncommitted-tips=Query, set, or clear READ UNCOMMITTED isolation.
pragma-recursive-triggers-tips=Query, set, or clear the recursive trigger capability.
pragma-reverse-unordered-selects-tips=When enabled, this PRAGMA causes many SELECT statements without an ORDER BY clause to emit their results in the reverse order from what they normally would. 
pragma-schema-version-tips=Get or set the value of the schema-version integer at offset 40 in the database header.
pragma-secure-delete-tips=Query or change the secure-delete setting. 
pragma-short-column-names-tips=Query or change the short-column-names flag. This flag affects the way SQLite names columns of data returned by SELECT statements. 
pragma-soft-heap-limit-tips=impose limits on the amount of heap memory that will be by all database connections within a single process.
pragma-stats-tips=This pragma returns auxiliary information about tables and indices.
pragma-synchronous-tips=Query or change the setting of the "synchronous" flag. 
pragma-temp-store-tips=Query or change the setting of the "temp_store" parameter.
pragma-threads-tips=Query or change the value of the sqlite3_limit(db,SQLITE_LIMIT_WORKER_THREADS,...) limit for the current database connection.
pragma-trusted-schema-tips=The trusted_schema setting is a per-connection boolean that determines whether or not SQL functions and virtual tables that have not been security audited are allowed to be run by views, triggers, or in expressions of the schema such as CHECK constraints, DEFAULT clauses, generated columns, expression indexes, and/or partial indexes.
pragma-user-version-tips=Get or set the value of the user-version integer at offset 60 in the database header.
pragma-vdbe-addoptrace-tips=Cause a complete VDBE opcodes to be displayed as they are created during code generation.
pragma-vdbe-debug-tips=
pragma-vdbe-listing-tips=
pragma-vdbe-trace-tips=
pragma-wal-autocheckpoint-tips=Queries or Sets the write-ahead log auto-checkpoint interval. 
pragma-wal-checkpoint-tips=Causes the content in the write-ahead log for database X on database connection D to be transferred into the database file and for the write-ahead log to be reset.
pragma-writable-schema-tips=The sqlite_schema table can be changed using ordinary UPDATE, INSERT, and DELETE statements.Warning: misuse of this pragma can easily result in a corrupt database file.
pragma-save-confirm=The PRAGMA statement will affect the state of database, are you sure to execute the following statement?
confirm-exec-text=OK & Execute